<template>
<div class="sm:px-0 px-5">
  <h2 class="text-turquoise text-center">/УСПЕШНЫЕ</h2>
  <h2 class="section-title">дела из практики</h2>
  <div class="">
    <ssr-carousel
      :rows-per-page="2"
      :show-arrows="true"
      :show-dots="true"
      :paginate-by-slide="true"
      :slides-per-page='1'
    >
      <template #dot='{ index, disabled }'>
        <svg v-if="disabled" xmlns="http://www.w3.org/2000/svg" width="12" height="12" viewBox="0 0 12 12" fill="none" class="mr-[5px] ml-[5px]">
          <circle cx="6" cy="6" r="3.75" fill="#30AFB8"/>
          <circle cx="6" cy="6" r="5.5" stroke="#30AFB8"/>
        </svg>
        <svg v-else xmlns="http://www.w3.org/2000/svg" width="8" height="8" viewBox="0 0 8 8" fill="none" class="mr-[5px] ml-[5px]">
          <circle cx="4" cy="4" r="4" fill="#B2B2B2"/>
        </svg>
      </template>
      <div class="slide" v-for="(item, index) in feedbacks" :key="index">
        <div class="bg-gray-dark text-white p-10 text-center sm:rounded-[40px] rounded-[20px]">
          <div v-for="(feedback, i) in item.data" :key="i">
            <h5 class="py-[10px]">{{feedback.title}}</h5>
            <p class="text-description">{{feedback.description}}</p>
          </div>
        </div>
      </div>
    </ssr-carousel>
  </div>
</div>
</template>

<script setup>
import {ref} from "vue";

const feedbacks = ref([
  {
    id: 1,
    data: [
      {
        title: 'Обратилась клиентка с просьбой лишить родительских прав её бывшего супруга',
        description: 'Бывший муж не пытался наладить отношения с ребёнком, а вскоре вообще пропал, перестал оказывать какую-либо материальную помощь. Не было известно его местонахождение.'
      },
      {
        title: 'Пути решения',
        description: 'Адвокаты изучили материалы по делу, разработали линию защиты, подготовили нужные документы для решения вопроса, затем подали исковое заявление в суд о лишении родительских прав отца ребёнка.'
      },
      {
        title: 'Результат',
        description: 'В ходе судебного разбирательства ответчик отказался от своих родительских прав на ребенка в пользу нашего доверителя. В судебном заседании было составлено нотариальное соглашение.'
      }
    ]
  },
  {
    id: 2,
    data: [
      {
        title: 'Обратилась клиентка с просьбой лишить родительских прав её бывшего супруга',
        description: 'Бывший муж не пытался наладить отношения с ребёнком, а вскоре вообще пропал, перестал оказывать какую-либо материальную помощь. Не было известно его местонахождение.'
      },
      {
        title: 'Пути решения',
        description: 'Адвокаты изучили материалы по делу, разработали линию защиты, подготовили нужные документы для решения вопроса, затем подали исковое заявление в суд о лишении родительских прав отца ребёнка.'
      },
      {
        title: 'Результат',
        description: 'В ходе судебного разбирательства ответчик отказался от своих родительских прав на ребенка в пользу нашего доверителя. В судебном заседании было составлено нотариальное соглашение.'
      }
    ]
  },
  {
    id: 3,
    data: [
      {
        title: 'Обратилась клиентка с просьбой лишить родительских прав её бывшего супруга',
        description: 'Бывший муж не пытался наладить отношения с ребёнком, а вскоре вообще пропал, перестал оказывать какую-либо материальную помощь. Не было известно его местонахождение.'
      },
      {
        title: 'Пути решения',
        description: 'Адвокаты изучили материалы по делу, разработали линию защиты, подготовили нужные документы для решения вопроса, затем подали исковое заявление в суд о лишении родительских прав отца ребёнка.'
      },
      {
        title: 'Результат',
        description: 'В ходе судебного разбирательства ответчик отказался от своих родительских прав на ребенка в пользу нашего доверителя. В судебном заседании было составлено нотариальное соглашение.'
      }
    ]
  }
]);
</script>

<style scoped>

</style>
